"""
В первом ящике находится 10 мячей, из которых 7 - белые. Во втором ящике - 11 мячей, из которых 9 белых.
Из каждого ящика вытаскивают случайным образом по два мяча.
Какова вероятность того, что все мячи белые?
Какова вероятность того, что ровно два мяча белые?
Какова вероятность того, что хотя бы один мяч белый?
"""

import scipy.special as sc

pp1 = sc.comb(7, 2) / sc.comb(10, 2) * sc.comb(9, 2) / sc.comb(11, 2)
pp2 = sc.comb(7, 2) / sc.comb(10, 2) * sc.comb(2, 2) / sc.comb(11, 2) + \
      (sc.comb(3, 2) / sc.comb(10, 2) * sc.comb(9, 2) / sc.comb(11, 2)) + \
      ((sc.comb(7, 1) * sc.comb(3, 1)) / sc.comb(10, 2) * (sc.comb(9, 1) * sc.comb(2, 1)) / sc.comb(11, 2))
pp3 = 1 - (sc.comb(3, 2) / sc.comb(10, 2) * sc.comb(2, 2) / sc.comb(11, 2))
print("вероятность того, что все мячи белые ", pp1)  # 0.3054545454545455
print("вероятность того, что ровно два мяча белые ", pp2)  # 0.20484848484848486
print("вероятность того, что хотя бы один мяч белый", pp3)  # 0.9987878787878788
