"""
Вероятность того, что лампочка перегорит в течение первого дня эксплуатации, равна 0.0004.
В жилом комплексе после ремонта в один день включили 5000 новых лампочек.
Какова вероятность, что ни одна из них не перегорит в первый день?
Какова вероятность, что перегорят ровно две?
"""

import numpy as np
from scipy.stats import poisson

p = 0.0004
n = 5000
m = 2
l = p * n
x = np.arange(0, 2) # если ноль и если две лампочки перегорят
pp = poisson.pmf(x, l) # формула пуассона
print("ни одна из лампочек не перегорит в первый день и что перегорят ровно две соответственно", pp)
# 0.13533528   0.27067057
