"""
Вероятность того, что стрелок попадет в мишень, выстрелив один раз, равна 0.8. Стрелок выстрелил 100 раз.
Найдите вероятность того, что стрелок попадет в цель ровно 85 раз.
"""

import scipy.special as sc

p = 0.8
q = 0.2
n = 100
k = 85

pp = sc.comb(n, k) * p ** k * q ** (n - k)  # формула бернулли
print("вероятность того, что стрелок попадет в цель ровно 85 раз ", pp)
